public class Main {
    public static void main(String[] args) {
        /// Task 1
//        Бухгалтер бухгалтер = new Бухгалтер();
//        Рабочий рабочий = new Рабочий();
//        Директор директор = new Директор();
//
//        бухгалтер.getPost();
//        рабочий.getPost();
//        директор.getPost();

        /// Task 2

        Фигура[] фигуры = new Фигура[5];
        фигуры[0] = new Треугольник(3, 6, 8);
        фигуры[1] = new Круг(15.1);
        фигуры[2] = new Прямоугольник(89.89, 38.34);
        фигуры[3] = new Треугольник(86.42, 69.28, 34.74);
        фигуры[4] = new Круг(49.24);

        double sum = 0;

        for (int i = 0; i < фигуры.length; i++) {
            sum += фигуры[i].getPerimeter();
        }
        System.out.println("Сумма периметров равна: " + sum);
    }
}